Tekla Open API Reference for Tekla Structures 2025
ModificationStamp Properties
The ModificationStamp type exposes the following members.
Properties
Name | Description
Guid
Guid representation
LocalStamp
 The modification stamp for the local changes.
ServerStamp
 The modification stamp from the multi-user server for the external changes caused by the saving of the multi-user model.
Top
See Also
Reference
ModificationStamp Class
Tekla.Structures.Model.History Namespace